{
  "intro": {
    "title": "How I Work",
    "paragraphs": [
      "I build models, not just products—introducing new delivery frameworks and prototyping methods that change how teams work. My goal isn’t just speed, but smarter collaboration and clearer outcomes.",
      "My background spans front-end architecture, AI strategy, digital product innovation, and creative development. I’ve led award-winning projects across retail, media, and tech—from Verizon’s Express retail pilot to WWF’s Apple Design Award-winning app.",
      "My philosophy stays consistent:",
      "**We elevate the discourse around technology and illustrate moments of possibility to differentiate our work.**",
      "I bring clarity, momentum, and a track record of making complex things work—without losing sight of the people they’re built for."
    ]
  },
  "experience": {
    "title": "Experience",
    "positions": [
      {
        "company": "World Wide Technology",
        "title": "Senior Manager, Digital Architecture",
        "duration": {
          "startDate": "June 2023",
          "endDate": "Present"
        },
        "description": "I lead a small, sharp team focused on making emerging technology—especially AI—practical inside a $20B enterprise. We prototype fast, frame clearly, and challenge slow-moving models. The work lives between strategy and execution: building tools, shaping narratives, and influencing how the business moves."
      },
      {
        "company": "Red Antler",
        "title": "Head of Technology",
        "duration": {
          "startDate": "September 2021",
          "endDate": "June 2023"
        },
        "description": "Brought a creative technologist's lens to a brand-first agency. My role was part builder, part translator—helping early-stage companies make smart technical bets while expanding the agency's POV on what technology could do."
      },
      {
        "company": "AKQA",
        "title": "Developer to Director of Creative Technology",
        "duration": {
          "startDate": "October 2009",
          "endDate": "August 2021"
        },
        "description": "Twelve years of building, leading, and evolving what creative technology meant inside one of the industry's most awarded agencies. I started as a front-end developer and eventually led emerging tech efforts across multiple offices—prototyping new interactions, onboarding major accounts, and mentoring teams through both polish and chaos."
      },
      {
        "company": "Under Armour",
        "title": "Manager - Interactive Technology",
        "duration": {
          "startDate": "May 2006",
          "endDate": "October 2009"
        },
        "description": "Joined as e-commerce became a core growth engine. I led development for campaign sites and boutique commerce tools, supporting key brand moments like the launch of Under Armour's footwear category and the relaunch of its women's line."
      },
      {
        "company": "Congruent Media",
        "title": "Lead Designer",
        "duration": {
          "startDate": "April 2004",
          "endDate": "May 2006"
        }
      },
      {
        "company": "North Charles Street Design Organization",
        "title": "Web Developer",
        "duration": {
          "startDate": "February 2003",
          "endDate": "March 2004"
        }
      },
      {
        "company": "Headcold Laboratories",
        "title": "Partner",
        "duration": {
          "startDate": "September 1998",
          "endDate": "January 2004"
        }
      },
      {
        "company": "Radicus Internet",
        "title": "Web Designer",
        "duration": {
          "startDate": "September 1999",
          "endDate": "December 2002"
        }
      }
    ]
  }
}
